In [1]:
import pandas as pd
import numpy as np
import re

In [3]:
df = pd.read_csv("../data/batting_summary.csv")

In [5]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.300
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.300

In [6]:
# Handling Non-numeric case

In [7]:
df["Strike_Rate"] = pd.to_numeric(df["Strike_Rate"].str.replace('-', ''), errors="coerce").fillna(0.00)

In [8]:
df["Strike_Rate"] = df["Strike_Rate"].astype(float)

In [9]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3

In [10]:
# Sort dataframe based on Match_no & Batting_Position

In [11]:
df.sort_values(by=["Match_no", "Batting_Position"], ascending=[False, True]).head(5)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate
899,48,India vs Australia,India,Rohit Sharma,1,c Travis Head b Glenn Maxwell,47,31,4,3,151.613
910,48,India vs Australia,Australia,David Warner,1,c Virat Kohli b Mohammed Shami,7,3,1,0,233.333
900,48,India vs Australia,India,Shubman Gill,2,c Adam Zampa b Mitchell Starc,4,7,0,0,57.143
911,48,India vs Australia,Australia,Travis Head,2,c Shubman Gill b Mohammed Siraj,137,120,15,4,114.167
901,48,India vs Australia,India,Virat Kohli,3,b Pat Cummins,54,63,4,0,85.714

In [12]:
df.columns

Index(['Match_no', 'Match_Between', 'Team_Innings', 'Batsman_Name',
       'Batting_Position', 'Dismissal', 'Runs', 'Balls', '4s', '6s',
       'Strike_Rate'],
      dtype='object')

In [13]:
df.dtypes

Match_no              int64
Match_Between        object
Team_Innings         object
Batsman_Name         object
Batting_Position      int64
Dismissal            object
Runs                  int64
Balls                 int64
4s                    int64
6s                    int64
Strike_Rate         float64
dtype: object

In [14]:
# Get the list of All unique matches

In [18]:
df[["Match_Between"]].drop_duplicates().tail()

               Match_Between
829  Bangladesh vs Australia
843      England vs Pakistan
865     India vs Netherlands
882     India vs New Zealand
899       India vs Australia

In [19]:
# Add "rank" column based on existing column on dataframe

In [20]:
df["Rank"] = df["Match_no"].rank(ascending=False).astype(int)

In [22]:
df.head(2)

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
0,1,England vs New Zealand,England,Jonny Bairstow,1,c Daryl Mitchell b Mitchell Santner,33,35,4,1,94.3,909
1,1,England vs New Zealand,England,Dawid Malan,2,c Tom Latham b Matt Henry,14,24,2,0,58.3,909

In [23]:
df[["Match_no", "Match_Between","Rank"]].drop_duplicates().head()

    Match_no              Match_Between  Rank
0          1     England vs New Zealand   909
14         2    Pakistan vs Netherlands   891
36         3  Afghanistan vs Bangladesh   872
53         4  South Africa vs Sri Lanka   854
71         5         Australia vs India   837

In [24]:
# Number of matches played by each team

In [25]:
df[["Match_no", "Team_Innings"]].drop_duplicates().Team_Innings.value_counts()

Team_Innings
Australia       11
India           11
New Zealand     10
South Africa    10
England          9
Pakistan         9
Netherlands      9
Afghanistan      9
Bangladesh       9
Sri Lanka        9
Name: count, dtype: int64

In [33]:
df[["Match_no", "Team_Innings"]].drop_duplicates().groupby(["Team_Innings"]).count()

              Match_no
Team_Innings
Afghanistan          9
Australia           11
Bangladesh           9
England              9
India               11
Netherlands          9
New Zealand         10
Pakistan             9
South Africa        10
Sri Lanka            9

In [35]:
# Get the number of matches played by Team India

In [39]:
df_grp = df[["Match_no","Match_Between","Team_Innings"]].drop_duplicates().groupby(["Team_Innings"])

In [45]:
df_grp.get_group("India")

     Match_no          Match_Between Team_Innings
82          5     Australia vs India        India
156         9   Afghanistan vs India        India
267        12      Pakistan vs India        India
362        17    Bangladesh vs India        India
438        21   New Zealand vs India        India
578        29       India vs England        India
648        33     India vs Sri Lanka        India
717        37  India vs South Africa        India
865        45   India vs Netherlands        India
882        46   India vs New Zealand        India
899        48     India vs Australia        India

In [46]:
df_grp.get_group("India").Team_Innings.count()

11

In [47]:
# Find Numebr of 4s and 6s hit by batsman

In [49]:
df_4s = df[["Batsman_Name","4s"]].groupby(["Batsman_Name"])["4s"].sum()
df_6s = df[["Batsman_Name","6s"]].groupby(["Batsman_Name"])["6s"].sum()

In [51]:
df_4s.head(2)

Batsman_Name
Abdullah Shafique    36
Adam Zampa            6
Name: 4s, dtype: int64

In [52]:
df_6s.tail(2)

Batsman_Name
Wesley Barresi    1
Will Young        6
Name: 6s, dtype: int64

In [56]:
pd.concat([df_4s, df_6s], axis=1).sort_values(by="6s", ascending=False).head()

                 4s  6s
Batsman_Name
Rohit Sharma     66  31
David Warner     53  28
Quinton de Kock  65  26
David Miller     34  26
Shreyas Iyer     37  24

In [57]:
pd.concat([df_4s, df_6s], axis=1).sort_values(by=["4s","6s"], ascending=[False,False]).head()

                 4s  6s
Batsman_Name
Virat Kohli      68   9
Rohit Sharma     66  31
Quinton de Kock  65  26
Rachin Ravindra  55  17
Devon Conway     54   4

In [58]:
# Strike rate by Batsman_Name

In [59]:
df_sr = df[["Batsman_Name","Strike_Rate"]].groupby(["Batsman_Name"]).mean(numeric_only=True)

In [60]:
df_sr.head(2)

                   Strike_Rate
Batsman_Name
Abdullah Shafique    71.388875
Adam Zampa           74.304571

In [62]:
df_sr.sort_values(by="Strike_Rate", ascending=False).head()

               Strike_Rate
Batsman_Name
David Willey    163.932667
Aiden Markram   141.043000
Hardik Pandya   137.500000
Rohit Sharma    127.904091
Gus Atkinson    122.233333

In [64]:
# No of records in dataframe

In [65]:
df.index

RangeIndex(start=0, stop=916, step=1)

In [66]:
len(df.index)

916

In [68]:
# Squeeze will squeeze single row dataframe into Series
# Squeeze will squeeze series into scalars
dfs = pd.read_csv("../data/batting_summary.csv", usecols=["Team_Innings"]).squeeze(axis=1)

In [70]:
dfs.head(4)

0    England
1    England
2    England
3    England
Name: Team_Innings, dtype: object

In [71]:
def check_india(ind):
	if ind == "India":
		return True
	else:
		return False

In [72]:
check_india("India")

True

In [80]:
dfs.apply(check_india).head()

0    False
1    False
2    False
3    False
4    False
Name: Team_Innings, dtype: bool

In [81]:
# Get all innings by Rohit

In [83]:
df[df["Batsman_Name"] == "Rohit Sharma"].head()

,Match_no,Match_Between,Team_Innings,Batsman_Name,Batting_Position,Dismissal,Runs,Balls,4s,6s,Strike_Rate,Rank
82,5,Australia vs India,India,Rohit Sharma,1,lbw b Josh Hazlewood,0,6,0,0,0.0,837
156,9,Afghanistan vs India,India,Rohit Sharma,1,b Rashid Khan,131,84,16,5,156.0,763
267,12,Pakistan vs India,India,Rohit Sharma,1,c Iftikhar Ahmed b Shaheen Afridi,86,63,6,6,136.5,692
362,17,Bangladesh vs India,India,Rohit Sharma,1,c Towhid Hridoy b Hasan Mahmud,48,40,7,2,120.0,597
438,21,New Zealand vs India,India,Rohit Sharma,1,b Lockie Ferguson,46,40,4,4,115.0,520

In [89]:
# Get all batsman who scored 100 or more

In [90]:
df[df["Runs"] >= 100][["Batsman_Name","Runs"]].head()

             Batsman_Name  Runs
11           Devon Conway   152
13        Rachin Ravindra   123
53        Quinton de Kock   100
55  Rassie van der Dussen   108
56          Aiden Markram   106